app/controllers/tweets_controller.rb

SELECT `tweets`.* FROM `tweets` ORDER BY created_at DESC
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)
---
  def index
    @tweets = Tweet.includes(:user).order("created_at DESC")

INSERT INTO `tweets` (`text`, `created_at`, `updated_at`, `user_id`) VALUES ('月 日 曜日 \r\n糖 g \r\n油 kcal \r\n体重 kg', '2021-03-26 03:34:53.453669', '2021-03-26 03:34:53.453669', 1)
---
  def create
    Tweet.create(tweet_params)

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 10 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 10
---
  def destroy
    tweet = Tweet.find(params[:id])
    tweet.destroy

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 11 LIMIT 1
UPDATE `tweets` SET `tweets`.`text` = '3月21\r\n\r\n糖　３０g\r\n油　４００kcal', `tweets`.`updated_at` = '2021-03-21 10:59:08.038801' WHERE `tweets`.`id` = 11
---
  def update
    tweet = Tweet.find(params[:id])
    tweet.update(tweet_params)

SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 7
---
  def show
    @comment = Comment.new
    @comments = @tweet.comments.includes(:user)

SELECT `tweets`.* FROM `tweets` WHERE (text LIKE('%gf%'))
---
    def search
      @tweets = Tweet.search(params[:keyword])

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 9 LIMIT 1
---
  def set_tweet
    @tweet = Tweet.find(params[:id])